In [1]:
# imports
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sbn

In [2]:
# Load files
try:
    test_file = "test.csv"
    train_file = "train.csv"
    train_data = pd.read_csv(train_file)
    test_data = pd.read_csv(test_file)
    print("Both files succesfully loaded")
except Exception as e:
    print("Error{}". format(e))

Both files succesfully loaded

In [3]:
train_data.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [4]:
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [5]:
# Variable assignment --> drop columns that we don't need. 
x_train_data = train_data.iloc[:,[1,2,3,4,5,6,7,9,11]]
x_test_data = test_data.iloc[:,[0,1,2,3,4,5,6,8,10]]

In [6]:
x_train_data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S

In [7]:
x_test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,7.8292,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,7.0000,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,9.6875,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,8.6625,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,12.2875,S

In [8]:
x_train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Name        891 non-null object
Sex         891 non-null object
Age         714 non-null float64
SibSp       891 non-null int64
Parch       891 non-null int64
Fare        891 non-null float64
Embarked    889 non-null object
dtypes: float64(2), int64(4), object(3)
memory usage: 62.7+ KB

In [9]:
x_test_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 9 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Fare           417 non-null float64
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(3)
memory usage: 29.5+ KB

In [10]:
# Fix NaN
train_mean_age = x_train_data["Age"].mean()
test_mean_age = x_test_data["Age"].mean()
x_train_data["Age"].fillna(train_mean_age, inplace=True)
x_test_data["Age"].fillna(test_mean_age, inplace=True)
x_train_data["Embarked"].fillna("X", inplace=True)
x_test_data["Embarked"].fillna("X", inplace = True)

/anaconda3/lib/python3.7/site-packages/pandas/core/generic.py:6130: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._update_inplace(new_data)

In [11]:
# Categorical Attributes
x_train_sex_cat = x_train_data[["Sex"]]
x_test_sex_cat = x_test_data[["Sex"]]
x_train_embarked_cat = x_train_data[["Embarked"]]
x_test_embarked_cat = x_test_data[["Embarked"]]

In [12]:
from sklearn.preprocessing import OrdinalEncoder, OneHotEncoder
ordinal_encoder = OrdinalEncoder()
x_train_sex_cat_encoded = ordinal_encoder.fit_transform(x_train_sex_cat)
x_test_sex_cat_encoded = ordinal_encoder.fit_transform(x_test_sex_cat)

In [13]:
cat_encoder = OneHotEncoder()
x_train_embarked_cat_1hot = cat_encoder.fit_transform(x_train_sex_cat)
x_test_embarked_cat_1hot = cat_encoder.fit_transform(x_test_sex_cat)

In [14]:
x_train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Name        891 non-null object
Sex         891 non-null object
Age         891 non-null float64
SibSp       891 non-null int64
Parch       891 non-null int64
Fare        891 non-null float64
Embarked    891 non-null object
dtypes: float64(2), int64(4), object(3)
memory usage: 62.7+ KB

In [15]:
x_test_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 9 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            418 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Fare           417 non-null float64
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(3)
memory usage: 29.5+ KB

In [16]:
# Deal with Name category --> Filter out marital status 
x_train_data['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
5                                       Moran, Mr. James
6                                McCarthy, Mr. Timothy J
7                         Palsson, Master. Gosta Leonard
8      Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                    Nasser, Mrs. Nicholas (Adele Achem)
10                       Sandstrom, Miss. Marguerite Rut
11                              Bonnell, Miss. Elizabeth
12                        Saundercock, Mr. William Henry
13                           Andersson, Mr. Anders Johan
14                  Vestrom, Miss. Hulda Amanda Adolfina
15                      Hewlett, Mrs. (Mary D Kingcome)
16                                  Rice, Master. Eugene
17                          Williams, Mr. Charles Eugene
18     Vander Planke, Mrs. Julius (Emelia Maria Vande...
19                               Masselmani, Mrs. Fatima
20                                  Fynney, Mr. Joseph J
21                                 Beesley, Mr. Lawrence
22                           McGowan, Miss. Anna "Annie"
23                          Sloper, Mr. William Thompson
24                         Palsson, Miss. Torborg Danira
25     Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...
26                               Emir, Mr. Farred Chehab
27                        Fortune, Mr. Charles Alexander
28                         O'Dwyer, Miss. Ellen "Nellie"
29                                   Todoroff, Mr. Lalio
                             ...
861                          Giles, Mr. Frederick Edward
862    Swift, Mrs. Frederick Joel (Margaret Welles Ba...
863                    Sage, Miss. Dorothy Edith "Dolly"
864                               Gill, Mr. John William
865                             Bystrom, Mrs. (Karolina)
866                         Duran y More, Miss. Asuncion
867                 Roebling, Mr. Washington Augustus II
868                          van Melkebeke, Mr. Philemon
869                      Johnson, Master. Harold Theodor
870                                    Balkic, Mr. Cerin
871     Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
872                             Carlsson, Mr. Frans Olof
873                          Vander Cruyssen, Mr. Victor
874                Abelson, Mrs. Samuel (Hannah Wizosky)
875                     Najib, Miss. Adele Kiamie "Jane"
876                        Gustafsson, Mr. Alfred Ossian
877                                 Petroff, Mr. Nedelio
878                                   Laleff, Mr. Kristo
879        Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
880         Shelley, Mrs. William (Imanita Parrish Hall)
881                                   Markun, Mr. Johann
882                         Dahlberg, Miss. Gerda Ulrika
883                        Banfield, Mr. Frederick James
884                               Sutehall, Mr. Henry Jr
885                 Rice, Mrs. William (Margaret Norton)
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [17]:
train_test_data = [x_train_data, x_test_data] # combining train and test dataset

for dataset in train_test_data:
    dataset['Title'] = dataset['Name'].str.extract(' ([A-Za-z]+)\.', expand=False)

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  after removing the cwd from sys.path.

In [18]:
x_train_data['Title'].value_counts()

Mr          517
Miss        182
Mrs         125
Master       40
Dr            7
Rev           6
Mlle          2
Col           2
Major         2
Sir           1
Don           1
Jonkheer      1
Countess      1
Capt          1
Ms            1
Mme           1
Lady          1
Name: Title, dtype: int64

In [19]:
x_test_data['Title'].value_counts()

Mr        240
Miss       78
Mrs        72
Master     21
Rev         2
Col         2
Dr          1
Dona        1
Ms          1
Name: Title, dtype: int64

In [20]:
title_mapping = {"Mr": 0, "Miss": 1, "Mrs": 2, 
                 "Master": 3, "Dr": 3, "Rev": 3, "Col": 3, "Major": 3, "Mlle": 3,"Countess": 3,
                 "Ms": 3, "Lady": 3, "Jonkheer": 3, "Don": 3, "Dona" : 3, "Mme": 3,"Capt": 3,"Sir": 3 }
for dataset in train_test_data:
    dataset['Title'] = dataset['Title'].map(title_mapping)

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """

In [21]:
x_test_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 10 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            418 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Fare           417 non-null float64
Embarked       418 non-null object
Title          418 non-null int64
dtypes: float64(2), int64(5), object(3)
memory usage: 32.7+ KB

In [22]:
x_train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Name        891 non-null object
Sex         891 non-null object
Age         891 non-null float64
SibSp       891 non-null int64
Parch       891 non-null int64
Fare        891 non-null float64
Embarked    891 non-null object
Title       891 non-null int64
dtypes: float64(2), int64(5), object(3)
memory usage: 69.7+ KB

In [23]:
# Drop 'Name'
x_train_data = x_train_data.drop("Name", axis = 1)
x_test_data = x_test_data.drop("Name", axis = 1)

In [24]:
x_train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Sex         891 non-null object
Age         891 non-null float64
SibSp       891 non-null int64
Parch       891 non-null int64
Fare        891 non-null float64
Embarked    891 non-null object
Title       891 non-null int64
dtypes: float64(2), int64(5), object(2)
memory usage: 62.7+ KB

In [25]:
x_test_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 9 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Sex            418 non-null object
Age            418 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Fare           417 non-null float64
Embarked       418 non-null object
Title          418 non-null int64
dtypes: float64(2), int64(5), object(2)
memory usage: 29.5+ KB

In [26]:
# Drop 'Sex' --> replace it with sex_encoded
x_train_data["Sex_encoded"] = x_train_sex_cat_encoded 
x_test_data["Sex_encoded"] = x_test_sex_cat_encoded

In [27]:
# Drop "Embarked" --> replace it with embarked_encoded
x_train_data.drop("Embarked", axis = 1)
x_test_data.drop("Embarked", axis = 1)

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Fare,Title,Sex_encoded
0,892,3,male,34.50000,0,0,7.8292,0,1.0
1,893,3,female,47.00000,1,0,7.0000,2,0.0
2,894,2,male,62.00000,0,0,9.6875,0,1.0
3,895,3,male,27.00000,0,0,8.6625,0,1.0
4,896,3,female,22.00000,1,1,12.2875,2,0.0
5,897,3,male,14.00000,0,0,9.2250,0,1.0
6,898,3,female,30.00000,0,0,7.6292,1,0.0
7,899,2,male,26.00000,1,1,29.0000,0,1.0
8,900,3,female,18.00000,0,0,7.2292,2,0.0
9,901,3,male,21.00000,2,0,24.1500,0,1.0
10,902,3,male,30.27259,0,0,7.8958,0,1.0
11,903,1,male,46.00000,0,0,26.0000,0,1.0
12,904,1,female,23.00000,1,0,82.2667,2,0.0
13,905,2,male,63.00000,1,0,26.0000,0,1.0
14,906,1,female,47.00000,1,0,61.1750,2,0.0
15,907,2,female,24.00000,1,0,27.7208,2,0.0
16,908,2,male,35.00000,0,0,12.3500,0,1.0
17,909,3,male,21.00000,0,0,7.2250,0,1.0
18,910,3,female,27.00000,1,0,7.9250,1,0.0
19,911,3,female,45.00000,0,0,7.2250,2,0.0
20,912,1,male,55.00000,1,0,59.4000,0,1.0
21,913,3,male,9.00000,0,1,3.1708,3,1.0
22,914,1,female,30.27259,0,0,31.6833,2,0.0
23,915,1,male,21.00000,0,1,61.3792,0,1.0
24,916,1,female,48.00000,1,3,262.3750,2,0.0
25,917,3,male,50.00000,1,0,14.5000,0,1.0
26,918,1,female,22.00000,0,1,61.9792,1,0.0
27,919,3,male,22.50000,0,0,7.2250,0,1.0
28,920,1,male,41.00000,0,0,30.5000,0,1.0
29,921,3,male,30.27259,2,0,21.6792,0,1.0
...,...,...,...,...,...,...,...,...,...
388,1280,3,male,21.00000,0,0,7.7500,0,1.0
389,1281,3,male,6.00000,3,1,21.0750,3,1.0
390,1282,1,male,23.00000,0,0,93.5000,0,1.0
391,1283,1,female,51.00000,0,1,39.4000,2,0.0
392,1284,3,male,13.00000,0,2,20.2500,3,1.0
393,1285,2,male,47.00000,0,0,10.5000,0,1.0
394,1286,3,male,29.00000,3,1,22.0250,0,1.0
395,1287,1,female,18.00000,1,0,60.0000,2,0.0
396,1288,3,male,24.00000,0,0,7.2500,0,1.0
397,1289,1,female,48.00000,1,1,79.2000,2,0.0
398,1290,3,male,22.00000,0,0,7.7750,0,1.0
399,1291,3,male,31.00000,0,0,7.7333,0,1.0
400,1292,1,female,30.00000,0,0,164.8667,1,0.0
401,1293,2,male,38.00000,1,0,21.0000,0,1.0
402,1294,1,female,22.00000,0,1,59.4000,1,0.0
403,1295,1,male,17.00000,0,0,47.1000,0,1.0
404,1296,1,male,43.00000,1,0,27.7208,0,1.0
405,1297,2,male,20.00000,0,0,13.8625,0,1.0
406,1298,2,male,23.00000,1,0,10.5000,0,1.0
407,1299,1,male,50.00000,1,1,211.5000,0,1.0
408,1300,3,female,30.27259,0,0,7.7208,1,0.0
409,1301,3,female,3.00000,1,1,13.7750,1,0.0
410,1302,3,female,30.27259,0,0,7.7500,1,0.0
411,1303,1,female,37.00000,1,0,90.0000,2,0.0
412,1304,3,female,28.00000,0,0,7.7750,1,0.0
413,1305,3,male,30.27259,0,0,8.0500,0,1.0
414,1306,1,female,39.00000,0,0,108.9000,3,0.0
415,1307,3,male,38.50000,0,0,7.2500,0,1.0
416,1308,3,male,30.27259,0,0,8.0500,0,1.0
417,1309,3,male,30.27259,1,1,22.3583,3,1.0

In [28]:
x_test_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 10 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Sex            418 non-null object
Age            418 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Fare           417 non-null float64
Embarked       418 non-null object
Title          418 non-null int64
Sex_encoded    418 non-null float64
dtypes: float64(3), int64(5), object(2)
memory usage: 32.7+ KB

In [29]:
x_train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
Survived       891 non-null int64
Pclass         891 non-null int64
Sex            891 non-null object
Age            891 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Fare           891 non-null float64
Embarked       891 non-null object
Title          891 non-null int64
Sex_encoded    891 non-null float64
dtypes: float64(3), int64(5), object(2)
memory usage: 69.7+ KB

In [30]:
x_train_data = x_train_data.drop("Sex", axis = 1)

In [31]:
x_test_data = x_test_data.drop("Sex", axis = 1)

In [32]:
x_test_data = x_test_data.drop("Embarked", axis = 1)

In [33]:
x_train_data = x_train_data.drop("Embarked", axis = 1)

In [34]:
x_test_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 8 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Age            418 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Fare           417 non-null float64
Title          418 non-null int64
Sex_encoded    418 non-null float64
dtypes: float64(3), int64(5)
memory usage: 26.2 KB

In [35]:
x_train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
Survived       891 non-null int64
Pclass         891 non-null int64
Age            891 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Fare           891 non-null float64
Title          891 non-null int64
Sex_encoded    891 non-null float64
dtypes: float64(3), int64(5)
memory usage: 55.8 KB

In [36]:
mean_fare = x_test_data["Fare"].mean()
x_test_data["Fare"].fillna(mean_fare, inplace=True)

In [37]:
x_test_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 8 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Age            418 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Fare           418 non-null float64
Title          418 non-null int64
Sex_encoded    418 non-null float64
dtypes: float64(3), int64(5)
memory usage: 26.2 KB

In [38]:
x_train_data.head()

   Survived  Pclass   Age  SibSp  Parch     Fare  Title  Sex_encoded
0         0       3  22.0      1      0   7.2500      0          1.0
1         1       1  38.0      1      0  71.2833      2          0.0
2         1       3  26.0      0      0   7.9250      1          0.0
3         1       1  35.0      1      0  53.1000      2          0.0
4         0       3  35.0      0      0   8.0500      0          1.0

In [39]:
x_test_data.head()

   PassengerId  Pclass   Age  SibSp  Parch     Fare  Title  Sex_encoded
0          892       3  34.5      0      0   7.8292      0          1.0
1          893       3  47.0      1      0   7.0000      2          0.0
2          894       2  62.0      0      0   9.6875      0          1.0
3          895       3  27.0      0      0   8.6625      0          1.0
4          896       3  22.0      1      1  12.2875      2          0.0

In [40]:
y_train = x_train_data["Survived"]
x_train = x_train_data.drop("Survived", axis = 1)
x_test = x_test_data.drop("PassengerId", axis = 1)
y_train.shape, x_train.shape, x_test.shape

((891,), (891, 7), (418, 7))

In [41]:
from sklearn.linear_model import LogisticRegression
model = LogisticRegression(random_state=42)
model.fit(x_train,y_train)
pred_log_reg = model.predict(x_test)
accuracy = round(model.score(x_train, y_train)*100,2)
print("Accuracy =", str(accuracy))

Accuracy = 81.82

/anaconda3/lib/python3.7/site-packages/sklearn/linear_model/logistic.py:433: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

In [42]:
# Overfitting?
from sklearn.ensemble import RandomForestClassifier
model = RandomForestClassifier(n_estimators = 50)
model.fit(x_train, y_train)
pred_RF = model.predict(x_test)
accuracy_RF = model.score(x_train, y_train)*100
print("Accuracy of Random Forest =",accuracy_RF)

Accuracy of Random Forest = 98.31649831649831

In [43]:
submission = pd.DataFrame({
    "PassengerId": x_test_data["PassengerId"],
    "Survived" : pred_log_reg
})

In [44]:
submission.to_csv('Submission.csv', index=False)